tutorials/multiphase/interPhaseChangeDyMFoam/propeller/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water vapour);

phaseChangeTwoPhaseMixture SchnerrSauer;

pSat             pSat       [1 -1 -2 0 0]    2300;   // saturation pressure

sigma           sigma [1 0 -2 0 0 0 0] 0.07;

water
{
    transportModel Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 9e-07;
    rho             rho [1 -3 0 0 0 0 0] 1000;
}

vapour
{
    transportModel Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 4.273e-04;
    rho             rho [1 -3 0 0 0 0 0] 0.02308;
}

KunzCoeffs
{
    UInf            UInf   [0 1 -1 0 0 0 0]     20.0;
    tInf            tInf   [0 0 1 0 0 0 0]      0.005; // L = 0.1 m
    Cc              Cc     [0 0 0 0 0 0 0]      1000;
    Cv              Cv     [0 0 0 0 0 0 0]      1000;
}

MerkleCoeffs
{
    UInf            UInf   [0 1 -1 0 0 0 0]     20.0;
    tInf            tInf   [0 0 1 0 0 0 0]      0.005;  // L = 0.1 m
    Cc              Cc     [0 0 0 0 0 0 0]      80;
    Cv              Cv     [0 0 0 0 0 0 0]      1e-03;
}

SchnerrSauerCoeffs
{
    n               n      [0 -3 0 0 0 0 0]     1.6e+13;
    dNuc            dNuc   [0 1 0 0 0 0 0]      2.0e-06;
    Cc              Cc     [0 0 0 0 0 0 0]      1;
    Cv              Cv     [0 0 0 0 0 0 0]      1;
}

// ************************************************************************* //
